In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan],
                "Ankara":[20,np.nan,25],
                "Izmir":[40,39,38]}
havaDurumu = pd.DataFrame(sozlukVerisi)
havaDurumu

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [3]:
havaDurumu.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [4]:
havaDurumu

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
havaDurumu.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [11]:
yeniVeri = {"Istanbul" : [30,29,np.nan],
            "Ankara": [20,np.nan,25],
            "Izmir": [40,39,38],
            "Antalya": [45,np.nan,np.nan]}

yeniHavaDurumu = pd.DataFrame(yeniVeri)

In [12]:
yeniHavaDurumu

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [14]:
yeniHavaDurumu.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [17]:
yeniHavaDurumu.fillna("-")

  Istanbul Ankara  Izmir Antalya
0     30.0   20.0     40    45.0
1     29.0      -     39       -
2        -   25.0     38       -

## groupby

In [21]:
maasSozlugu = {"Departman" : ["Yazilim","Yazilim","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calisan Ismi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
              "Maas" : [100,200,300,400,500,600]}
maasDataFrame = pd.DataFrame(maasSozlugu)
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazilim        Ahmet   100
1    Yazilim       Mehmet   200
2  Pazarlama         Atil   300
3  Pazarlama        Burak   400
4      Hukuk       Zeynep   500
5      Hukuk        Fatma   600

In [1]:
groupObject = maasDataFrame.groupby("Departman")

NameError: name 'maasDataFrame' is not defined

In [24]:
groupObject.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazilim               2     2

In [25]:
groupObject.mean()

            Maas
Departman
Hukuk      550.0
Pazarlama  350.0
Yazilim    150.0

In [26]:
groupObject.max()

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   600
Pazarlama        Burak   400
Yazilim         Mehmet   200

In [27]:
groupObject.min()

          Calisan Ismi  Maas
Departman
Hukuk            Fatma   500
Pazarlama         Atil   300
Yazilim          Ahmet   100

In [28]:
groupObject.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazilim     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0